Documents/Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Задача</Name>
			<BasedOn>
				<xr:Item>Document.Задача</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МодулиСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подробности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПорядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХЗ_ОписаниеРешения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХЗ_Подробности</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительОтклик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РелизыКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВОписаниеПоставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГотовностиТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗадачиВнешний</Name>
					<Comment>Номер задачи в какой-либо иной базе или баг-трекере</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СутьРешенияЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавлен</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХЗ</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтслеживающиеПользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Задача/Ext/ObjectModule.bsl
Процедура _ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	ТекущийОбъект.ХЗ_Подробности = Новый ХранилищеЗначения(ЭтаФорма.ФД_Подробности);
	ТекущийОбъект.Подробности = ЭтаФорма.ФД_Подробности.ПолучитьТекст();

	ТекущийОбъект.ХЗ_ОписаниеРешения = Новый ХранилищеЗначения(ЭтаФорма.ФД_ОписаниеРешения);
	ТекущийОбъект.ОписаниеРешения = ЭтаФорма.ФД_ОписаниеРешения.ПолучитьТекст();

	Если Ссылка.Пустая() Тогда
		ТекущийОбъект.ДатаИзменения = ТекущийОбъект.Дата;
	Иначе
		ТекущийОбъект.ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
	Если ТекущийОбъект.СостояниеЗадачи = Справочники.СостоянияЗадач.Закрыта И Не ЗначениеЗаполнено(ТекущийОбъект.ДатаЗакрытия) Тогда 
		ТекущийОбъект.ДатаЗакрытия = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура _ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект) Экспорт
	
	ЭтаФорма.ФД_Подробности = ТекущийОбъект.ХЗ_Подробности.Получить();
	Если ПустаяСтрока(ЭтаФорма.ФД_Подробности.ПолучитьТекст()) И Не ПустаяСтрока(ТекущийОбъект.Подробности) Тогда
		_ВремСтр = СтрЗаменить(ТекущийОбъект.Подробности, "
		|", "<BR>");
		_ВремСтр = СтрЗаменить(_ВремСтр, " ", "&nbsp;");
		ЭтаФорма.ФД_Подробности.УстановитьHTML(_ВремСтр, Новый Структура);
	КонецЕсли;

	ЭтаФорма.ФД_ОписаниеРешения = ТекущийОбъект.ХЗ_ОписаниеРешения.Получить();
	Если ПустаяСтрока(ЭтаФорма.ФД_ОписаниеРешения.ПолучитьТекст()) И Не ПустаяСтрока(ТекущийОбъект.ОписаниеРешения) Тогда
		_ВремСтр = СтрЗаменить(ТекущийОбъект.ОписаниеРешения, "
		|", "<BR>");
		_ВремСтр = СтрЗаменить(_ВремСтр, " ", "&nbsp;");
		ЭтаФорма.ФД_ОписаниеРешения.УстановитьHTML(_ВремСтр, Новый Структура);
	КонецЕсли;

КонецПроцедуры

Процедура _ЗаписатьПриложение(АдресВХранилище, ВыбранноеИмяФайла) Экспорт
	
	ЗВХ = ПолучитьИзВременногоХранилища(АдресВХранилище);
	НовСтр = Приложения.Добавить();
	НовСтр.ХЗ = Новый ХранилищеЗначения(ЗВХ);
	ОчищенноеИмяФайла = ВыбранноеИмяФайла;
	Поз = 10;
	Пока Поз > 0 Цикл
		Поз1 = Найти(ОчищенноеИмяФайла, "\");
		Поз2 = Найти(ОчищенноеИмяФайла, "/");
		Поз = Макс(Поз1, Поз2);
		Если Поз > 0 Тогда
			ОчищенноеИмяФайла = Прав(ОчищенноеИмяФайла, СтрДлина(ОчищенноеИмяФайла) - Поз);
		КонецЕсли;
	КонецЦикла;
	НовСтр.ИмяФайла = ОчищенноеИмяФайла;
	НовСтр.Добавлен = ТекущаяДата();
	НовСтр.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	НовСтр.Размер = ЗВХ.Размер() / 1024;
	
	Записать();
	
КонецПроцедуры

Процедура _ПрочитатьПриложение(НомерСтроки, АдресВХранилище, УИД) Экспорт
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(Приложения[НомерСтроки].ХЗ.Получить(), УИД);
	
КонецПроцедуры

Процедура ПроверитьКорректностьНаСервере(ЭтаФорма, ТекущийОбъект, Отказ, МассивСообщений) Экспорт
	
	Если ТекущийОбъект.СостояниеЗадачи = Справочники.СостоянияЗадач.Закрыта И Не ЗначениеЗаполнено(ТекущийОбъект.РелизКонфигурации) И ТекущийОбъект.ТипЗадачи.НеобходимоУказаниеРелиза Тогда 
		МассивСообщений.Добавить(Новый Структура("ТекстСообщения, Поле", "Не указано значение поля <Релиз конфигурации>. Данный тип задачи требует указание релиза!", "Объект.РелизКонфигурации"));
		Отказ = Истина;
	КонецЕсли;
	
	Если ТекущийОбъект.СостояниеЗадачи = Справочники.СостоянияЗадач.Закрыта Тогда 
		Если ТекущийОбъект.ВключатьВОписаниеПоставки = Истина Тогда 
			мОписаниеРешенияПустое = ПустаяСтрока(СокрЛП(ЭтаФорма.ФД_ОписаниеРешения.ПолучитьТекст()));
			Если мОписаниеРешенияПустое Тогда 
				МассивСообщений.Добавить(Новый Структура("ТекстСообщения, Поле", "Не указано значение поля <Описание решения>", "ФД_ОписаниеРешения"));
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура _ЗаблокироватьОбъект(ЭтаФорма, ТекущийОбъект, тОписаниеОшибки) Экспорт 
	
	Если НЕ ЭтоНовый() тогда
		Попытка
			ЗаблокироватьДанныеДляРедактирования(ЭтотОбъект.Ссылка, ЭтотОбъект.ВерсияДанных, ЭтаФорма.УникальныйИдентификатор);
		Исключение
			ЭтаФорма.ТолькоПросмотр = Истина;
			тОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры

Процедура _РазблокироватьОбъект(ЭтаФорма, ТекущийОбъект) Экспорт 
	
	Если НЕ ЭтоНовый() тогда
		Попытка
			РазблокироватьДанныеДляРедактирования(ЭтотОбъект.Ссылка, ЭтаФорма.УникальныйИдентификатор);
		Исключение
			тОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьПредставлениеИзмененийОбъекта() Экспорт
	
	ПредставлениеИзменений = "";
	Для Каждого ТекРеквизит Из ЭтотОбъект.Метаданные().Реквизиты Цикл
		
		Если ТекРеквизит.Имя = "ДатаИзменения" ИЛИ
			ТипЗнч(ЭтотОбъект[ТекРеквизит.Имя]) = Тип("ХранилищеЗначения") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Ссылка[ТекРеквизит.Имя] <> ЭтотОбъект[ТекРеквизит.Имя] Тогда 
			ПредставлениеИзменений = ПредставлениеИзменений + ТекРеквизит.Синоним + ": " + Ссылка[ТекРеквизит.Имя] + " -> " + ЭтотОбъект[ТекРеквизит.Имя] + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПустаяСтрока(ПредставлениеИзменений) Тогда 
		ПредставлениеИзменений = "ИЗМЕНЕНИЯ:" + Символы.ПС + ПредставлениеИзменений;
	КонецЕсли;
	
	Возврат ПредставлениеИзменений;
	
КонецФункции

Процедура ДобавитьПользователяВОтслеживающие() Экспорт
	
	
КонецПроцедуры

Функция ПолучитьТекущееСостояниеЗадачи()
	
	ТекущееСостояниеЗадачи = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияСостоянийЗадачСрезПоследних.Состояние
	|ИЗ
	|	РегистрСведений.ИсторияСостоянийЗадач.СрезПоследних(, Задача = &Задача) КАК ИсторияСостоянийЗадачСрезПоследних";
	
	Запрос.УстановитьПараметр("Задача", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ТекущееСостояниеЗадачи = Выборка.Состояние;
	КонецЕсли;
	
	Возврат ТекущееСостояниеЗадачи;
	
КонецФункции

Процедура ЗаписатьСостояниеЗадачи() Экспорт 
	
	ТекущееСостояниеЗадачи = ПолучитьТекущееСостояниеЗадачи();
	
	Если ТекущееСостояниеЗадачи <> СостояниеЗадачи Тогда 
		
		МенеджерЗаписи = РегистрыСведений.ИсторияСостоянийЗадач.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Период 			= ТекущаяДата();
		МенеджерЗаписи.Задача 			= Ссылка;
		МенеджерЗаписи.Состояние		=  СостояниеЗадачи;
		
		МенеджерЗаписи.Пользователь 	= ПараметрыСеанса.ТекущийПользователь;
		
		МенеджерЗаписи.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задача") Тогда
		// Заполнение шапки
		Модуль = ДанныеЗаполнения.Модуль;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Проект = ДанныеЗаполнения.Проект;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Статус = ДанныеЗаполнения.Статус;
		Суть = ДанныеЗаполнения.Суть;
		ТипЗадачи = ДанныеЗаполнения.ТипЗадачи;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
